DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
void handleAssetUpload() {
  HTTPUpload& upload = webServer.upload();

  if (upload.status == UPLOAD_FILE_START) {
    assetUploadSucceeded = false;
    assetUploadError = "";
    assetUploadPath = requestedAssetPath();
    Serial.printf("asset_upload_start path=%s filename=%s content_length=%zu\n", assetUploadPath.c_str(), upload.filename.c_str(), upload.contentLength);
    drawUpdateStatus("Loading display");
    renderer.ResetGifStateForAssetUpdate();
    waitStatusRendered = true;

    if (!isSafeAssetPath(assetUploadPath)) {
      setAssetUploadError("invalid asset path");
      return;
    }
    if (!LittleFS.begin()) {
      setAssetUploadError("filesystem mount failed");
      return;
    }
    if (!ensureAssetParentDirs(assetUploadPath)) {
      setAssetUploadError("create parent directory failed");
      return;
    }
    if (LittleFS.exists(assetUploadPath)) {
      LittleFS.remove(assetUploadPath);
    }
    File file = LittleFS.open(assetUploadPath, "w");
    if (!file) {
      setAssetUploadError("open asset failed");
      return;
    }
    file.close();
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (assetUploadError.length() > 0) {
      return;
    }
    File file = LittleFS.open(assetUploadPath, "a");
    if (!file) {
      setAssetUploadError("append asset failed");
      return;
    }
    if (file.write(upload.buf, upload.currentSize) != upload.currentSize) {
      setAssetUploadError("write asset failed");
    }
    file.close();
  } else if (upload.status == UPLOAD_FILE_END) {
    if (assetUploadError.length() == 0) {
      assetUploadSucceeded = true;
      Serial.printf("asset_upload_success path=%s bytes=%zu\n", assetUploadPath.c_str(), upload.totalSize);
    }
  } else if (upload.status == UPLOAD_FILE_ABORTED) {
    setAssetUploadError("upload aborted");
  }
  yield();
}

void handleAssetUploadResult() {
  if (!assetUploadSucceeded || assetUploadError.length() > 0) {
    const String error = assetUploadError.length() > 0 ? assetUploadError : "upload failed";
    webServer.send(400, "text/plain; charset=utf-8", error);
    return;
  }

  String out;
  out.reserve(120);
  out += "{\"ok\":true,\"path\":\"";
  out += jsonEscape(assetUploadPath);
  out += "\"}";
  webServer.send(200, "application/json", out);
}

void handleAssetDelete() {
  String path = webServer.arg("path");
  path.trim();
  if (!isSafeAssetPath(path)) {
    webServer.send(400, "text/plain; charset=utf-8", "invalid asset path");
    return;
  }
  if (!LittleFS.begin()) {
    webServer.send(500, "text/plain; charset=utf-8", "filesystem mount failed");
    return;
  }
  if (!LittleFS.exists(path)) {
    webServer.send(404, "text/plain; charset=utf-8", "asset not found");
    return;
  }
  renderer.ResetGifStateForAssetUpdate();
  if (!LittleFS.remove(path)) {
    webServer.send(500, "text/plain; charset=utf-8", "asset delete failed");
    return;
  }
  Serial.printf("asset_deleted path=%s\n", path.c_str());
  webServer.send(200, "application/json", "{\"ok\":true}");
}

String updatePageHTML() {
  const String installCommand = updateInstallCommand();
  String html;
  html.reserve(3000);
  html += F("<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'>");
  html += F("<title>VibeTV Update</title><style>");
  html += F(":root{color-scheme:dark;--bg:#0b0c0d;--line:#2b2f35;--text:#f6f4ed;--muted:#a9adb3;--signal:#c7ff00}*{box-sizing:border-box}body{font-family:-apple-system,BlinkMacSystemFont,Segoe UI,sans-serif;margin:0;background:var(--bg);color:var(--text)}main{max-width:620px;margin:0 auto;padding:28px 20px 34px}.brand,summary{font-weight:900;color:var(--signal)}h1{font-size:36px;line-height:1.05;margin:22px 0 10px}.lead,.muted{color:var(--muted);line-height:1.45}section{border-top:1px solid var(--line);padding-top:14px;margin-top:14px}.update{border:1px solid #6f8f00;background:#1b2400;border-radius:8px;padding:12px;color:#f1ffd0}.update-link{display:none}input,button{width:100%;font:inherit;padding:12px;border-radius:8px;border:1px solid #3a3f47;background:#101214;color:#fff;margin-top:10px}button{background:var(--signal);color:#111;border:0;font-weight:900}code,pre{font-family:ui-monospace,SFMono-Regular,Menlo,Consolas,monospace}pre{white-space:pre-wrap;word-break:break-word;background:#08090a;border:1px solid #30343a;border-radius:8px;padding:14px}</style></head><body><main>");
  html += F("<div class='brand'>Vibe TV</div><h1>Firmware update.</h1><p class='lead'>Use the Mac app to download, verify, upload, and restart Vibe TV.</p>");
  html += updateStatusHTML(false);
  html += F("<section><h2>Install with Mac</h2><p class='muted'>Run this on the connected Mac. Companion downloads firmware, checks SHA256, uploads it, and waits for restart.</p><pre>");
  html += htmlEscape(installCommand);
  html += F("</pre></section>");
  html += F("<details><summary>Manual upload tools</summary><section><h2>Firmware</h2><p class='muted'>Upload <code>firmware.bin</code> only when support asks for it.</p>");
  html += F("<form method='post' action='/update/firmware' enctype='multipart/form-data'>");
  html += F("<input type='file' name='firmware' accept='.bin,application/octet-stream' required>");
  html += F("<button type='submit'>Upload firmware</button></form></section>");
  html += F("</details>");
  html += F("<p class='muted'><a href='/'>Back to setup</a> | <a href='/health'>Device status</a> | <a href='/assets'>File list</a></p></main></body></html>");
  return html;
}

void handleUpdatePage() {
  webServer.send(200, "text/html; charset=utf-8", updatePageHTML());
}

void setOtaError(const String& message) {
  otaUploadError = message;
  Serial.printf("ota_error message=%s\n", otaUploadError.c_str());
  if (Update.hasError()) {
    Update.printError(Serial);
  }
}

size_t otaMaxSizeForCommand(int command) {
  if (command == U_FS) {
    return static_cast<size_t>(FS_end - FS_start);
  }
  return static_cast<size_t>((ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000);
}

void handleOtaUpload(int command, const char* target) {
  HTTPUpload& upload = webServer.upload();

